Repository: mahdiehsani1/leit
Catalog: lib/l10n/app_*.arb
Languages: de, fa

# tabHome
source: Home
de: Startseite
fa: خانه

# tabPractice
source: Practice
de: Üben
fa: تمرین

# tabStatistics
source: Statistics
de: Statistik
fa: آمار

# tabSettings
source: Settings
de: Einstellungen
fa: تنظیمات

# searchHint
source: Search...
de: Suchen...
fa: جستجو...

source: Search Results
de: Suchergebnisse
fa: نتایج جستجو

# noResults
source: No results found
de: Keine Ergebnisse gefunden
fa: نتیجه‌ای یافت نشد

source: Your Categories
de: Deine Kategorien
fa: دسته‌های شما

source: View all categories
de: Alle anzeigen
fa: مشاهده همه دسته‌ها

# noItemsYet
source: No items yet. Add your first word!
de: Noch keine Einträge. Füge dein erstes Wort hinzu!
fa: هنوز موردی ندارید. اولین کلمه را اضافه کنید!

source: Continue Learning
de: Weiterlernen
fa: ادامه یادگیری

# startLeitnerSession
source: Start your Leitner session
de: Leitner-Sitzung starten
fa: شروع جلسه لایتنر

# addNewItemAction
source: Add New Item
de: Neues Element
fa: افزودن مورد جدید

# addItemSubtitle
source: Words, verbs, sentences...
de: Wörter, Verben, Sätze...
fa: کلمات، افعال، جملات...

source: Recently Added
de: Kürzlich hinzugefügt
fa: اخیراً اضافه‌شده‌ها

# practiceTitle
source: Practice
de: Üben
fa: تمرین

# reversePracticeTitle
source: Reverse Practice
de: Umgekehrtes Üben
fa: تمرین معکوس

# mixedPracticeTitle
source: Mixed Practice
de: Gemischtes Üben
fa: تمرین ترکیبی

source: Start Training Session
de: Training starten
fa: شروع جلسه تمرین

source: Choose Mode
de: Modus wählen
fa: انتخاب حالت

# modeNormal
source: Normal
fa: عادی

# modeNormalDesc
source: German → English/Persian
de: Deutsch → Englisch/Persisch
fa: آلمانی → انگلیسی/فارسی

# modeReverse
source: Reverse
de: Umgekehrt
fa: معکوس

# modeReverseDesc
source: English/Persian → German
de: Englisch/Persisch → Deutsch
fa: انگلیسی/فارسی → آلمانی

# modeMixed
source: Mixed
de: Gemischt
fa: ترکیبی

# modeMixedDesc
source: Randomly mixed cards
de: Zufällig gemischt
fa: کارت‌های ترکیبی تصادفی

source: Overview
de: Übersicht
fa: نمای کلی

source: Total Cards
de: Gesamtkarten
fa: کل کارت‌ها

source: Weak Cards
de: Schwache Karten
fa: کارت‌های ضعیف

source: Due Today
de: Heute fällig
fa: موعد امروز

source: Weekly Progress
de: Wöchentlicher Fortschritt
fa: پیشرفت هفتگی

source: Box Status
fa: وضعیت جعبه‌ها

# leitnerBoxLabel
source: Leitner Box {number}
fa: جعبه لایتنر {number}

# cardsCount
source: {count} cards
de: {count} Karten
fa: {count} کارت

# sessionNoCardsTitle
source: No cards due!
de: Keine Karten fällig!
fa: کارت موعددار ندارید!

# sessionNoCardsSubtitle
source: You're all caught up for now.
de: Du bist auf dem Laufenden.
fa: فعلاً همه چیز بررسی شده است.

# sessionCompleteTitle
source: Session Complete!
de: Sitzung beendet!
fa: جلسه کامل شد!

# sessionCompleteSubtitle
source: You've reviewed {count} cards.
de: Du hast {count} Karten wiederholt.
fa: شما {count} کارت را مرور کردید.

# sessionMoreAvailable
source: Great job! You did {count} cards. Ready for more?
de: Super! {count} Karten erledigt. Bereit für mehr?
fa: عالی بود! {count} کارت انجام دادید. آماده ادامه هستید؟

# btnContinueSession
source: Continue Session
de: Weiterlernen
fa: ادامه جلسه

# btnFinishForNow
source: Finish for Now
de: Jetzt beenden
fa: فعلاً کافیست

# progressLabel
source: Progress
de: Fortschritt
fa: پیشرفت

# btnAgain
source: Again
de: Nochmal
fa: دوباره

# btnHard
source: Hard
de: Schwer
fa: سخت

# btnEasy
source: Easy
de: Einfach
fa: آسان

# statsPageTitle
source: Statistics
de: Statistik
fa: آمار

# statReviewed
source: Reviewed
de: Wiederholt
fa: مرور شده

# statLearned
source: Learned
de: Gelernt
fa: یادگرفته‌شده

# statAccuracy
source: Accuracy
de: Genauigkeit
fa: دقت

# reviewTrendTitle
source: Review Trend (Last 10 Days)
de: Lerntrend (letzte 10 Tage)
fa: روند مرور (۱۰ روز گذشته)

# noReviewActivity
source: No review activity recently
de: Keine Lernaktivität in letzter Zeit
fa: اخیراً فعالیت مروری نداشته‌اید

# accuracyChartTitle
source: Accuracy (Last 10 Days)
de: Genauigkeit (letzte 10 Tage)
fa: دقت (۱۰ روز گذشته)

# noAccuracyData
source: No accuracy data available
de: Keine Daten verfügbar
fa: داده‌ای برای دقت موجود نیست

source: Leitner Distribution
de: Leitner-Verteilung
fa: توزیع لایتنر

source: Box 1 (New)
de: Box 1 (Neu)
fa: جعبه ۱ (جدید)

source: Box 2
fa: جعبه ۲

source: Box 3
fa: جعبه ۳

source: Box 4
fa: جعبه ۴

source: Box 5
fa: جعبه ۵

# box6Mastered
source: Box 6 (Fully Mastered)
de: Box 6 (Gemeistert)
fa: جعبه ۶ (کاملاً مسلط)

source: Smart Insight
de: Smarte Einsicht
fa: بینش هوشمند

# insightBox1Full
source: Your Box 1 is getting full. Consider a review session today!
de: Deine Box 1 wird voll. Erwäge heute eine Wiederholung!
fa: جعبه ۱ شما در حال پر شدن است. بهتر است امروز مرور داشته باشید!

# insightMastered
source: You have fully mastered {count} items! Outstanding work.
de: Du hast {count} Elemente gemeistert! Hervorragend.
fa: شما {count} مورد را کاملاً مسلط شده‌اید! عالی عمل کردید.

# insightLongTerm
source: You are building strong long-term memory. Keep it up!
de: Du baust ein starkes Langzeitgedächtnis auf. Weiter so!
fa: در حال ساختن حافظه بلندمدت قوی هستید. ادامه دهید!

# insightDefault
source: Keep practicing regularly to see improvements.
de: Übe regelmäßig, um Verbesserungen zu sehen.
fa: با تمرین منظم، پیشرفت بیشتری می‌بینید.

source: Strong Areas
de: Starke Bereiche
fa: نقاط قوت

source: Needs Practice
de: Braucht Übung
fa: نیازمند تمرین

# notEnoughData
source: Not enough data yet.
de: Noch nicht genügend Daten.
fa: داده کافی موجود نیست.

source: Day Streak
de: Tage-Streak
fa: زنجیره روزانه

source: Daily Goal
de: Tagesziel
fa: هدف روزانه

source: Weekly Goal
de: Wochenziel
fa: هدف هفتگی

# btnContinuePractice
source: Continue Practice
de: Weiter üben
fa: ادامه تمرین

source: Error loading stats
de: Fehler beim Laden der Statistik
fa: خطا در بارگذاری آمار

# settingsPageTitle
source: Settings
de: Einstellungen
fa: تنظیمات

# sectionGeneral
source: General
de: Allgemein
fa: عمومی

# sectionDataSync
source: Cloud & Sync
fa: فضای ابری و همگام‌سازی

# sectionAbout
source: About
de: Über
fa: درباره

# langTitle
source: Language
de: Sprache
fa: زبان

# darkModeTitle
source: Dark Mode
de: Dunkelmodus
fa: حالت تیره

# dailyReminderTitle
source: Daily Reminder
de: Tägliche Erinnerung
fa: یادآوری روزانه

source: Backup to Cloud
de: Backup in die Cloud
fa: پشتیبان‌گیری در فضای ابری

source: Restore from Cloud
de: Aus Cloud wiederherstellen
fa: بازیابی از فضای ابری

source: Clear All Data
de: Alle Daten löschen
fa: حذف تمام داده‌ها

source: Version
fa: نسخه

source: Sign Out
de: Abmelden
fa: خروج

# signInSync
source: Sign in with Google
de: Anmelden mit Google
fa: ورود با گوگل

source: Developed with
de: Entwickelt mit
fa: ساخته شده با

# byAuthor
source: by
de: von
fa: توسط

# selectLanguageDialog
source: Select Language
de: Sprache auswählen
fa: انتخاب زبان

# restoreDialogTitle
source: Restore from Cloud
de: Aus Cloud wiederherstellen
fa: بازیابی از فضای ابری

# restoreDialogMsg
source: This will merge your cloud data with current device data.
de: Dies führt deine Cloud-Daten mit den aktuellen Daten zusammen.
fa: این عملیات داده‌های ابری را با داده‌های فعلی دستگاه ترکیب می‌کند.

# clearDialogTitle
source: Clear All Data?
de: Alles löschen?
fa: حذف همه داده‌ها؟

# clearDialogMsg
source: Warning: This will permanently delete ALL your words, progress, and statistics.
de: Warnung: Dies löscht dauerhaft ALLE deine Wörter und Fortschritte.
fa: هشدار: این کار تمام کلمات، پیشرفت و آمار شما را برای همیشه حذف می‌کند.

# clearDialogOptionCloud
source: Also delete Cloud Backup
de: Auch Cloud-Backup löschen
fa: حذف پشتیبان ابری نیز

# btnCancel
source: Cancel
de: Abbrechen
fa: انصراف

# btnRestore
source: Restore
de: Wiederherstellen
fa: بازیابی

# btnDeleteEverything
source: Delete Everything
de: Alles löschen
fa: حذف همه

# msgDataRestored
source: Data restored from Cloud successfully!
de: Daten erfolgreich aus der Cloud wiederhergestellt!
fa: داده‌ها با موفقیت از فضای ابری بازیابی شدند!

# msgBackupSuccess
source: Backup uploaded to Cloud successfully!
de: Backup erfolgreich in die Cloud hochgeladen!
fa: پشتیبان‌گیری با موفقیت در فضای ابری ذخیره شد!

# msgBackupFailed
source: Cloud Backup Failed: {error}
de: Cloud-Backup fehlgeschlagen: {error}
fa: خطا در پشتیبان‌گیری: {error}

# msgRestoreFailed
source: Restore Failed: {error}
de: Wiederherstellung fehlgeschlagen: {error}
fa: خطا در بازیابی: {error}

# msgSignInRequired
source: Please sign in to use this feature.
de: Bitte melden Sie sich an, um diese Funktion zu nutzen.
fa: لطفاً برای استفاده از این قابلیت وارد شوید.

# msgDataDeleted
source: All data has been deleted successfully.
de: Alle Daten wurden erfolgreich gelöscht.
fa: تمام داده‌ها با موفقیت حذف شدند.

# msgReminderSet
source: Daily reminder set for 10:00 AM
de: Erinnerung auf 10:00 Uhr gesetzt
fa: یادآوری روزانه برای ساعت ۱۰ صبح تنظیم شد.

# msgPermissionDenied
source: Permission denied.
de: Berechtigung verweigert.
fa: دسترسی رد شد.

# msgLanguageChanged
source: Language changed to {lang}.
de: Sprache zu {lang} geändert.
fa: زبان به {lang} تغییر کرد.

# introSkip
source: Skip
de: Überspringen
fa: رد کردن

# introNext
source: Get Started
de: Loslegen
fa: شروع

# intro1Title
source: Save Words
de: Wörter speichern
fa: ذخیره کلمات

# intro1Text
source: Collect and organize German words, phrases, idioms, and verb–noun combinations with clean translations in English and Persian.
de: Sammle und organisiere deutsche Wörter, Phrasen und Redewendungen mit klaren Übersetzungen.
fa: کلمات، عبارات، اصطلاحات و ترکیب‌های فعل-اسم آلمانی را با ترجمه‌های دقیق انگلیسی و فارسی جمع‌آوری و سازماندهی کنید.

# intro2Title
source: Learn Smart
de: Smart lernen
fa: یادگیری هوشمند

# intro2Text
source: Strengthen your memory using the proven Leitner system. Review items at the perfect time, improve retention naturally.
de: Stärke dein Gedächtnis mit dem bewährten Leitner-System. Wiederhole zum perfekten Zeitpunkt.
fa: با سیستم اثبات‌شده لایتنر حافظه خود را تقویت کنید؛ در زمان مناسب مرور کنید و ماندگاری را افزایش دهید.

# intro3Title
source: Hear Clearly
de: Klar hören
fa: شنیدن شفاف

# intro3Text
source: Listen to precise German and English pronunciations and understand meanings in both languages with clarity.
de: Höre präzise deutsche und englische Aussprachen und verstehe die Bedeutungen klar.
fa: تلفظ دقیق آلمانی و انگلیسی را بشنوید و معنی‌ها را با وضوح بیشتری درک کنید.

# allItemsTitle
source: All Items
de: Alle Elemente
fa: همه موارد

source: No items found
de: Keine Elemente gefunden
fa: موردی یافت نشد

# msgItemDeleted
source: Item deleted successfully
de: Element gelöscht
fa: مورد با موفقیت حذف شد

# optionViewDetails
source: View Details
de: Details anzeigen
fa: مشاهده جزئیات

# optionEditItem
source: Edit Item
de: Bearbeiten
fa: ویرایش

# optionDeleteItem
source: Delete Item
de: Löschen
fa: حذف

# deleteItemDialogTitle
source: Delete Item?
de: Löschen?
fa: حذف مورد؟

# deleteItemDialogMsg
source: Are you sure you want to delete '{item}'?
de: Möchtest du '{item}' wirklich löschen?
fa: آیا می‌خواهید «{item}» را حذف کنید؟

# btnDelete
source: Delete
de: Löschen
fa: حذف

# detailsTitle
source: Details
fa: جزئیات

# sectionTranslations
source: Translations
de: Übersetzungen
fa: ترجمه‌ها

# labelEnglish
source: English
de: Englisch
fa: انگلیسی

# labelPersian
source: Persian
de: Persisch
fa: فارسی

# sectionGrammar
source: Grammar & Forms
de: Grammatik & Formen
fa: گرامر و حالت‌ها

# labelArticle
source: Article
de: Artikel
fa: آرتیکل

# labelPlural
source: Plural
fa: جمع

# sectionExamples
source: Example sentences
de: Beispielsätze
fa: جملات نمونه

# sectionExplanation
source: Explanation
de: Erklärung
fa: توضیح

# sectionSynAnt
source: Synonyms & Antonyms
de: Synonyme & Antonyme
fa: مترادف‌ها و متضادها

# labelSynonyms
source: Synonyms
de: Synonyme
fa: مترادف‌ها

# labelAntonyms
source: Antonyms
de: Antonyme
fa: متضادها

# sectionExtra
source: Extra
fa: سایر موارد

# labelTags
source: Tags
fa: برچسب‌ها

# labelNotes
source: Notes
de: Notizen
fa: یادداشت‌ها

# addItemTitle
source: Add New Item
de: Neues Element
fa: افزودن مورد جدید

# editItemTitle
source: Edit Item
de: Element bearbeiten
fa: ویرایش مورد

# btnSave
source: Save
de: Speichern
fa: ذخیره

# btnUpdate
source: Update
de: Aktualisieren
fa: به‌روزرسانی

# labelContentType
source: Content type
de: Inhaltstyp
fa: نوع محتوا

# hintSelectType
source: Select content type
de: Typ wählen
fa: انتخاب نوع محتوا

# sheetChooseType
source: Choose content type
de: Inhaltstyp wählen
fa: انتخاب نوع محتوا

# labelGermanText
source: German text
de: Deutscher Text
fa: متن آلمانی

# hintGermanText
source: Wort, Satz oder Ausdruck...
fa: کلمه، جمله یا عبارت...

# labelEnTrans
source: English translations
de: Englische Übersetzungen
fa: معانی انگلیسی

# hintEnTrans
source: English meaning
de: Englische Bedeutung
fa: معنای انگلیسی

# btnAddEn
source: Add English meaning
de: Englisch hinzufügen
fa: افزودن معنای انگلیسی

# labelFaTrans
source: Persian meanings
de: Persische Bedeutungen
fa: معانی فارسی

# hintFaTrans
source: Persian meaning
de: Persische Bedeutung
fa: معنای فارسی

# btnAddFa
source: Add Persian meaning
de: Persisch hinzufügen
fa: افزودن معنای فارسی

# labelLevel
source: Level
de: Niveau
fa: سطح

# trailingOptional
source: Optional
fa: اختیاری

# trailingMultiple
source: Multiple allowed
de: Mehrere erlaubt
fa: چندتایی مجاز است

# hintExample
source: Example sentence in German
de: Beispielsatz auf Deutsch
fa: جمله نمونه به آلمانی

# btnAddExample
source: Add example
de: Beispiel hinzufügen
fa: افزودن مثال

# hintTags
source: grammar, travel, B2 ... (comma separated)
de: Grammatik, Reise, B2 ... (kommagetrennt)
fa: گرامر، سفر، B2 ... (با کاما جدا کنید)

# hintNotes
source: Any extra notes about usage, register, etc.
de: Zusätzliche Notizen zur Verwendung...
fa: یادداشت اضافی درباره کاربرد، لحن و ...

# sectionNounDetails
source: Noun details
de: Nomen-Details
fa: جزئیات اسم

# hintPlural
source: Plural form (optional)
fa: فرم جمع (اختیاری)

# sectionVerbForms
source: Verb forms
de: Verbformen
fa: زمان‌های فعل

# hintPrateritum
source: Präteritum (simple past)
de: Präteritum
fa: Präteritum (گذشته ساده)

# hintPartizip
source: Partizip II (optional)
fa: Partizip II (اختیاری)

# hintSynonym
source: Synonym
fa: مترادف

# btnAddSynonym
source: Add synonym
de: Synonym hinzufügen
fa: افزودن مترادف

# hintAntonym
source: Antonym
fa: متضاد

# btnAddAntonym
source: Add antonym
de: Antonym hinzufügen
fa: افزودن متضاد

# sectionUsageNotes
source: Usage notes
de: Verwendungshinweise
fa: یادداشت‌های کاربردی

# hintUsageNotes
source: How is this adverb usually used?
de: Wie wird dieses Adverb verwendet?
fa: این قید معمولاً چگونه استفاده می‌شود؟

# hintExplanation
source: Short explanation or context of use
de: Kurze Erklärung oder Kontext
fa: توضیح کوتاه یا زمینه استفاده

# errSelectType
source: Please select content type
de: Bitte Inhaltstyp wählen
fa: لطفاً نوع محتوا را انتخاب کنید

# errEnterEnglish
source: Please enter at least 1 English meaning
de: Bitte mind. 1 englische Bedeutung eingeben
fa: حداقل یک معنای انگلیسی وارد کنید

# errEnterPersian
source: Please enter at least 1 Persian meaning
de: Bitte mind. 1 persische Bedeutung eingeben
fa: حداقل یک معنای فارسی وارد کنید

# errPrateritum
source: Please enter Präteritum form
de: Bitte Präteritum eingeben
fa: فرم Präteritum را وارد کنید

# errPerfekt
source: Please enter Perfekt form
de: Bitte Perfekt eingeben
fa: فرم Perfekt را وارد کنید

# errGermanText
source: Please enter the main German text
de: Bitte deutschen Haupttext eingeben
fa: لطفاً متن اصلی آلمانی را وارد کنید

# errDuplicate
source: This item already exists in your database!
de: Dieses Element existiert bereits!
fa: این مورد قبلاً در پایگاه داده وجود دارد!

# msgSaved
source: Saved successfully
de: Erfolgreich gespeichert
fa: با موفقیت ذخیره شد

# msgUpdated
source: Item updated successfully
de: Erfolgreich aktualisiert
fa: مورد با موفقیت به‌روزرسانی شد

# typeWord
source: Word (Noun)
de: Wort (Nomen)
fa: اسم

# typeWordSub
source: Simple word with article and plural
de: Einfaches Wort mit Artikel und Plural
fa: کلمه ساده با آرتیکل و جمع

# typeVerb
source: Verb
fa: فعل

# typeVerbSub
source: With past forms & example
de: Mit Vergangenheitsformen & Beispiel
fa: با زمان‌های گذشته و مثال

# typeAdj
source: Adjective
de: Adjektiv
fa: صفت

# typeAdjSub
source: With synonyms & antonyms
de: Mit Synonymen & Antonymen
fa: با مترادف و متضاد

# typeAdv
source: Adverb
fa: قید

# typeAdvSub
source: Usage and example sentence
de: Verwendung und Beispielsatz
fa: کاربرد و جمله نمونه

# typeVerbNoun
source: Verb–Noun Phrase
de: Verb–Nomen-Verbindung
fa: عبارت فعل–اسم

# typeVerbNounSub
source: e.g. eine Entscheidung treffen
de: z.B. eine Entscheidung treffen
fa: مثلاً eine Entscheidung treffen

# typeSentence
source: Sentence
de: Satz
fa: جمله

# typeSentenceSub
source: Full sentence + translations
de: Ganzer Satz + Übersetzungen
fa: جمله کامل + ترجمه‌ها

# typeIdiom
source: Idiom / Fixed Phrase
de: Redewendung
fa: اصطلاح / عبارت ثابت

# typeIdiomSub
source: Expression with explanation
de: Ausdruck mit Erklärung
fa: عبارت با توضیح

# typeNounPhrase
source: Noun Phrase
de: Nominalphrase
fa: عبارت اسمی

# typeNounPhraseSub
source: e.g. der rote Apfel
de: z.B. der rote Apfel
fa: مثلاً der rote Apfel

# catWords
source: Words
de: Wörter
fa: کلمات

# catVerbs
source: Verbs
de: Verben
fa: افعال

# catAdj
source: Adjectives
de: Adjektive
fa: صفت‌ها

# catAdv
source: Adverbs
de: Adverbien
fa: قیدها

# catVerbNoun
source: Verb–Noun Phrases
de: Verb–Nomen
fa: عبارات فعل–اسم

# catIdioms
source: Idioms
de: Idiome
fa: اصطلاحات

# catSentences
source: Sentences
de: Sätze
fa: جملات

# catUnknown
source: Unknown
de: Unbekannt
fa: نامشخص

source: Send Feedback
de: Feedback senden
